// საკლასო დავალება:

// შექმენით ფუნქცია სახელად discountFunc. ამ ფუნქციას პარამეტრი არ სჭირდება. ფუნქციაში მომხმარებელს შემოატანინეთ ასაკი. 

// თუ ასაკი ნაკლებია 18-ზე, დაუბეჭდეთ 20%, თუ ასაკი მეტია ან ტოლია 18-ზე და ნაკლებია 65-ზე, დაუბეჭდეთ 5%, ხოლო ყველა სხვა დანარჩენ შემთხვევაში დაუბეჭდეთ 10%.

// ფუნქცია გამოიძახეთ მაშინ, როდესაც ვებსაიტზე მომხმარებელი დააკლიკებს ღილაკს
function discountFunc() {
    let age = Number(prompt("Enter your age: "));

    if (age < 18) {
        alert("discount 20%")
    } else if (age >=18 && age < 65) {
        alert("discount 5 %")
    } else {
        alert("discount 10%")
    }
}

let num = 0;

while (num < 100) {
    console.log(num);
    num += 5; 
}
// საკლასო დავალება:

// შექმენით for ციკლი, რომელიც იტერაციას მოახდენს 10-ჯერ და თითოუელ იტერაციაზე დაბეჭდავს hello-ს კონსოლში.
for (let i = 0; i < 10; i++) {
    console.log("hello");
}